[
  {
    "id": "student-forum-2025-10-10",
    "caption": "Hey, CS/DS/AI Majors! Have feedback about your student experience? Enjoy some pizza and share your concerns about coursework, academic and career resources, office hours, community, and more at our Student Forum on October 16th in SCHM 113!\n\nOpen to both West Lafayette and Indianapolis students!\n\nMake sure to RSVP with the QR code or through this link (also in our Link Tree!) :\n\nhttp://bit.ly/4oyCid5\n\nWe hope to see you there!!",
    "timestamp": "2025-10-10T12:00:00Z",
    "imageUrl": "/Instagram Posts/images/student-forum.png",
    "permalink": "https://www.instagram.com/p/DPpIMbDktAS/"
  },
  {
    "id": "tracks-panel-2025-10-10",
    "caption": "Curious about where CS can take you? Join us for the CS Tracks Panel on Oct 21st, 7:30–9 PM in Lawson Commons! Hear from upperclassmen about their experiences in different CS tracks, get your questions answered, and enjoy free food!\n\nReserve your spot with the QR code above or the link in bio!",
    "timestamp": "2025-10-10T10:00:00Z",
    "imageUrl": "/Instagram Posts/images/tracks-panel.png",
    "permalink": "https://www.instagram.com/p/DPo1snWiQ4w/"
  },
  {
    "id": "pizza-with-professors-2025-10-09",
    "caption": "Join the CS Undergraduate Student Board for an engaging Pizza with Professor session featuring Professor Turkstra! Professor Turkstra will share insights about his teaching philosophy, research interests, and experiences in the field of computer science.\n\nBring your questions and get ready for an interactive discussion!\n\n📅 Date: 20th October 2025\n⏰ Time: 5:00pm to 6:00pm\n📍 Location: WALC B093\n\nRSVP now and don’t miss out on this opportunity to learn, network, and, of course, eat pizza! You can RSVP with the link below or find it in our bio.\n\nRSVP at https://tinyurl.com/pizzawithprofessorturkstra",
    "timestamp": "2025-10-09T12:00:00Z",
    "imageUrl": "/Instagram Posts/images/pizza-with-professors.png",
    "permalink": "https://www.instagram.com/p/DPmoLRNErUS/"
  },
  {
    "id": "help-room-2025-10-01",
    "caption": "Need help in CS 193, 180, 182, or 240? USB’s Help Room is designed to serve as additional office hours for core CS curriculum.\n\nDebugging late at night and struggling to find a solution? Studying for an exam and having some last-minute questions? Our team of tutors is here to help you out! We have tutors working from Monday to Thursday, offering both virtual (Zoom) and in-person (DSAI lobby) sessions.\n\nIf you want more information or want to see the schedule for Help Room, go to purdueusb.com//wiki/help-room, scan the qr code, or visit the link in our bio.\n\nIf you have any questions about Help Room, reach out to liu3688@purdue.edu and tsze@purdue.edu",
    "timestamp": "2025-10-01T12:00:00Z",
    "imageUrl": "/Instagram Posts/images/help-room.png",
    "permalink": "https://www.instagram.com/p/DPRTaIOgBiW/"
  },
  {
    "id": "freshman-social-hour-2025-09-26",
    "caption": "Hey CS/DS/AI Freshmen!\n\nLooking to meet new people and connect with your classmates? Come join us for Game Night in the Lawson Commons on 9/30!\n\nWe’ll have a ton of games in a relaxed, welcoming setting, including Mario Kart on the Lawson screen, jenga, cards, and more! There will also be free pizza!\n\nIf you’re interested, make sure to scan the QR code or visit the link in our bio to RSVP!",
    "timestamp": "2025-09-26T12:00:00Z",
    "imageUrl": "/Instagram Posts/images/freshman-social-hour.png",
    "permalink": "https://www.instagram.com/p/DPCUvMxCbEG/"
  },
  {
    "id": "mentor-callout-2025-09-18",
    "caption": "Are you passionate about helping others succeed, or just looking to give back to the CS/DS/AI community? As a mentor for USB, you’ll guide incoming freshmen through their transition to college life. Mentors provide advice on academics, campus resources, and getting involved, while also offering support and encouragement along the way. Share your experiences, answer questions, and help new students feel confident, connected, and ready to thrive.\nMake a difference in someone’s college journey — sign up to be a mentor today via the QR code or the link: https://docs.google.com/forms/d/e/1FAIpQLSfdMPSUWsInx0LCsnfFbLybcRDFvxYE5bLrEvkRVnxMsVVUqg/viewform",
    "timestamp": "2025-09-18T12:00:00Z",
    "imageUrl": "/Instagram Posts/images/mentor-callout.png",
    "permalink": "https://www.instagram.com/p/DOw5K31CU6P/"
  }
]

