{
  "blogPosts": [
    {
      "title": "Considering Graduate School at Purdue?",
      "subtitle": "If you are considering graduate school at Purdue, here are some incentives to apply.",
      "author": "Pinaki Mohanty",
      "authorImage": "../board member photos/webp/Pinaki-Mohanty.png",
      "date": "May 27, 2022",
      "category": "belonging",
      "content": "Considering Grad School at Purdue CS? If so, this blog post is just for you.\n\nA little bit about me(or why should you listen to me…). My name is Pinaki. I am a second-semester Master's student in the CS+STAT Joint Masters at Purdue. I graduated from Purdue in May 2021 with a Bachelor in Computer Science with specializations in Machine Intelligence, Database and Information Systems, and Theory. I also minored in Math and Statistics. During my undergraduate years at Purdue, I have been a part of Association of Multicultural Computer Scientists(AMCS), Reach Out for Computer Science(ROCS), Global Science Partners(GSP), and of course Undergraduate Student Board for Computer Science(USB). I have been a part of USB, actively and passively, for more than three years. I have contributed to initiatives like TA Training and Virtual Office Hours. Advocating on behalf of students is something I enjoy doing and that is why I am here to help! A key concern amongst undergrads, often echoed via student forums, here at Purdue is the lack of knowledge about grad school. I am here to advocate why you should consider Purdue CS for an MS degree, especially if you are finishing/finished your undergrad at Purdue. What prompted me to go for an MS? I wanted to learn about topics whose discussion was beyond the scope of the classroom; I wanted to augment my knowledge. Also, I enjoyed school in general and wanted to explore research. I started applying for master's programs sometime around September 2020. I had all my decisions in by February-March 2021. Despite some really competitive offers, I decided to pursue my MS at Purdue owing to the following reasons.\n\nCost of Living for some locations was 2-3x more than that of West Lafayette\nTeaching Assistantship: This was a big one because often MS programs do not offer assistantships. At Purdue, my tuition was covered, and I got a stipend once in two weeks. Taking a wide variety of courses at Purdue equips you with the knowledge of 'how to run the course'. This also ensures constituency and quality. Keep in mind, being a GTA comes with a lot of responsibilities; you are in charge of the quality of the fabric of the curriculum. Also, my medical insurance was covered. I was essentially staff now.\nFamiliarity with the department was another one. Purdue has been my home for 4 years. Saying goodbye can be hard :')\nInflux of New Faculty (especially in AI, ML) made me stay at Purdue with the prospect of research collaboration\nPurdue's CS MS Program offers MS Degrees in many flavors: General/Vanilla, CSE (Computational Sciences and Engineering), CLS (Computational Life Sciences), and CS+STAT.\nThis factor made me strongly consider Purdue as this kind of flexibility was not available everywhere. Other than that, there is the 5 Year BS+MS combined degree program, which can help you save a year. This does not apply to me as I took 4 sweet years to complete my BS and then separately applied for an MS. If you are at the junction of deciding on grad school, I hope these pointers would make Purdue look like an attractive option. I also serve as the Undergraduate Committee Representative at the Graduate Student Board for Computer Science (GSB). If you have any questions, feel free to reach out. Boiler Up!"
    },
    {
      "title": "Purdue Technical Projects",
      "subtitle": "Struggling to start personal projects, we can help.",
      "author": "Sarah Pushparaj",
      "authorImage": "../board member photos/webp/Sarah-Pushparaj.webp",
      "date": "May 24, 2022",
      "category": "TechnicalProjects",
      "content": "Hey there! If you're a CS or DS major, you know the importance of personal projects, whether it's to amplify your resume/LinkedIn or to get a better understanding of a certain class topic. But what about starting a project just because you want to, because you are passionate about your field and want to make new contributions. Maybe you don't like the way something is done, so you believe you can change it for the better. Or maybe you thought, I wish something like this existed and decided that you can make it happen?\n\nPicture this: you start that project, but you encounter obstacle after obstacle. You don't have enough time to figure it out on your own, and you don't have sufficient experience to practically apply concepts you've just learned. Or maybe, classes, work, and life gets in the way. What should you do?\n\nIf you don't already know, the Purdue Undergraduate Student Board exists to serve the Purdue CS/DS student community by acting as a liaison to the CS department.\n\nThere's always room for new ideas, for improvement, and that's why we want to help! We're working on a brand-new initiative, Purdue Technical Projects, so USB can actively sponsor your projects! Here's the basic idea of how it'll work:\n\nThis initiative will be run throughout the semester. USB will set up a website that will feature existing student-created Purdue-related projects and an area where students can input their project ideas. There will also be a submission box for already completed projects, and every project will be vetted by our initiative team before it is accepted. In the first month of the semester, students can enter their project ideas and the support they seek, in terms of group size and experience. Throughout the next couple of months, groups can be finalized and they can start implementing their projects. At the end of the semester, we will host a panel in which groups can showcase their projects, with the goal of acknowledgment and widespread use throughout the Purdue community!\n\nWe don't want this to be another homework assignment or project for school, so USB's role will be less restrictive. We'll contact the groups, verify that progress is being made, and act as a point of contact. We'll set up a discord server in which groups can communicate with each other as well as contact the initiative members for any questions/concerns/ideas. Even though it's semester-based, if a group hasn't finished their project, or feels that it's not ready for the showcase, no worries! They can always present next semester. Project potentiality is exciting, especially Purdue-related projects. We all know and love Boilerexams (boilerexams.com), single-handedly saving our grades! There are so many things to keep track of as a student at Purdue, luckily the multitude of Purdue apps (created by students!) makes our lives easier."
    },
    {
      "title": "Balancing CS and Exercise",
      "subtitle": "Health and Fitness @ Purdue",
      "author": "Weiyi Tan",
      "authorImage": "../board member photos/webp/Weiyi-Tan.webp",
      "date": "April 18, 2022",
      "category": "exercise",
      "content": "Growing up as an athlete in my home country, I was exercising almost daily since part of my day was already reserved for our practice sessions. I knew that every day, from 5 to 8 pm, I would be in the pool training my synchronized swimming techniques. However, when I came to Purdue without any athletic responsibilities, it was hard to regain the same discipline and motivation to exercise as I once had. I would usually plan to go to the gym earlier in the day, but then put it off and lay in bed instead. Then, I found out about GroupX, a fitness program offered by Purdue RecWel1, and it is now a constant part of my life at Purdue.\n\nGroupX contains different types of classes for different fitness levels. It ranges from fun classes, such as Zumba and African Dance, to intense ones, such as HIIT and Cycle. The best thing about it, at least for me, is that you get to work out with other people! There is something about seeing other people panting and struggling that motivates you to continue exercising. The instructors would often shout words of encouragement too, inspiring you to push through the sweat and tears.\n\nAnother reason why I love GroupX is that there are so many classes every weekday. They even hold BodyPump and Cycle classes, the most popular ones, twice a day! So, despite my busy schedule, I could still have time to attend my favorite GroupX classes. Additionally, I like that they have a no-show policy as it forces me to exercise when I'm lazy. Regardless of how I am feeling before the GroupX class, I always leave the CoRec happier and more energetic. It also provides a short, needed break from my coding projects, allowing me to return with a fresh mind.\n\nIf you are still hesitant about GroupX, it should be worth noting that GroupX is free (as of Spring 2022) to all students! So, it won't hurt to try some of the classes, especially if you are new to exercise and don't know where to start. Some of my recommendations for beginners are Barre, BodyPump, Total Body Strength, and Zumba. The first three are strength and toning workouts that focus on all muscle groups, while Zumba is a fun and easy-to-follow dance-fitness class. Then, when you feel stronger and are looking for more intense workouts, I would suggest trying Cycle, GRIT, HIIT, and Step. I would recommend starting with GRIT before trying HIIT as they are very similar, with the exception that GRIT is 15 minutes shorter.\n\nOne piece of advice about registering for GroupX classes is to register early. All GroupX classes can be registered up to 72 hours in advance, so some of the popular classes could be fully booked before you know it. Though if you are unsure about your schedule, you could still check for class spots about an hour before the class since most people cancel last minute.\n\nAt the end of the day, I hope GroupX positively benefits your Purdue experience just like it did mine. If you are afraid of attending a class alone, feel free to hit me up at wytan@purdue.edu and we could attend one together!\n\nHere are some helpful links to get started with GroupX! Steps for reserving a class, cancelling your reservation, and class descriptions: https://www.purdue.edu/recwell/fitness-wellness/fitness/group-x/index.php GroupX Schedule: https://www.purdue.edu/recwell/fitness-wellness/fitness/group-x/schedules.php"
    },
    {
      "title": "Interested in Degree+?",
      "subtitle": "Taking languages classes unlocked a different perspective",
      "author": "Emily Hao",
      "authorImage": "../board member photos/webp/Emily-Hao.webp",
      "date": "April 16, 2022",
      "category": "Degree+",
      "content": "One of the most useful assignments I did for CS 19100 was creating a plan of study for my next four years at Purdue. While looking into the various course requirements for the different tracks, the College of Science, and the University Core Curriculum, I found that I had a lot more space in my schedule to take elective courses than I had expected. In large part due to the credit I earned in high school, but also a surprising amount of double counting, I had very few requirements left to fulfill for the College of Science core curriculum in particular. I would need to add credits to my schedule, with a dilemma of where those credits would come from.\n\nConveniently for me, I had heard of Degree+ both through 191 and my German professor. Initially, I did not give the program much thought, but after doing more research on the Degree+ program, I decided eventually to talk to my advisor and pursue a German major in addition to Computer Science.\n\nThe Degree+ program is designed to allow students to pursue an additional major in the College of Liberal Arts with the Liberal Arts core waived. For me, this meant I would only need to take eight additional courses, and all specific to the German major. Of course, this may differ from person to person depending on the major they choose to pursue and the classes they have or have not already taken or received credit for.\n\nWhile my decision to add a Degree+ major (rather than simply adding a minor, or taking more elective courses of my choosing) was primarily influenced by the amount of flexibility I had with my schedule, there were other factors involved. Perhaps the most important was that I enjoyed German, and could see myself continuing to enjoy it beyond a few language courses. If I were any less interested in German, I know that I would have chosen to do something else with the space I had in my schedule. More broadly, I did not want to box myself into exclusively taking technical STEM-related courses for the rest of my time at Purdue. I believe it is important to experience some variety in the education you receive, because many of the skills gained in different environments are transferable elsewhere. Furthermore, the difference in perspective can be valuable in affecting your approach or understanding of one or another subject; no field is truly independent of other fields. Finally, proficiency in a foreign language has practical value beyond college as well—a fact many are certainly familiar with.\n\nAfter considering these factors and making my decision, officially adding German to my major was itself extremely simple. My current advisor submitted a curriculum change request (CODO), the request was reviewed by the College of Liberal Arts, and once approved on their end, I approved it myself through MyPurdue.\n\nI wanted to add a German major because I found it interesting and useful, and doing so was (by design) an easy process that didn't add unmanageable amounts to my workload. Degree+ isn't for everyone, and the commitment involved certainly isn't zero, but any student outside of the College of Liberal Arts can easily choose to do the same, whether they want to add a major in philosophy, political science, or even theater.\n\nFor those interested, more information can be found here: https://www.cla.purdue.edu/undergradci/degreeplus/index.html."
    },
    {
      "title": "Keys for Success in CS180",
      "subtitle": "CS180 is a Purdue CS rite of passage, but with these tips, you can get through!",
      "author": "Christopher Lehman",
      "authorImage": "../board member photos/webp/Christopher-Lehman.webp",
      "date": "April 16, 2022",
      "category": "FreshmanYear, CS180",
      "content": "Walking into CS180 for the first time I was met with a combination of exhilaration and nervousness. Never before had I taken a class with so many other people and I couldn't wrap my head around how it would work. How do they give assignments and grade them for everyone? How does the professor answer questions if someone is confused? Do my classmates know the same level of programming? It took some time and effort, but I did get acquainted with the environment and found my groove with lectures, labs, assignments, and tests. Even as a senior looking back, CS180 ended up being one of my favorite classes at Purdue and I'd like to share some tips that helped me along the way.\n\nFind a Study Group - Whether it's fellow students in your lab, or other CS majors on your dorm floor, do your best to meet and get to know people in a similar situation as you. You'll be amazed at the good times that will come: laughing about silly NullPointerExceptions or catching the midnight midterm grind reviewing the intricacies of polymorphism. Plus, it's great to have some fun experiences to share when you need a break from studying. I especially enjoyed playing basketball at the CoRec and board games like Werewolf.\n\nAsk Questions - There will be an online forum like Piazza or Campuswire with a plethora of questions about the current assignments and lecture topics that are very helpful! I encourage you to browse, add to, or – if you're feeling confident – answer another student's question! It's also great to follow the questions students are asking in lecture, often on an app like Hotseat. The TA's watch and answer questions so you can get clarifications without breaking the flow of the ongoing lecture.\n\nUse the Debugger - The debugger is a tool built into most programming applications, including IntelliJ which you will use for this class. Admittedly, it looks menacing when you first learn it. There's too many buttons and it feels like you need an instruction manual to use it right. Give it some time, however, and you'll see how powerful it can be. When trying to track the state of your program, print statements help sometimes but the debugger's ability to show all variable values and see how executing each line of code changes was extremely valuable to me as I resolved the peskiest of bugs.\n\nStart Assignments Early - It's fine if you don't finish early, but it goes a long way to start looking at the handout for the new homework or project when it first comes out. I would often reach a mental block on assignments in which I faced an issue and nothing I did seems to make progress toward a resolution. Nine times out of ten, taking a break and looking at it with fresh eyes helped me find a fix instantly, but I could only do this if the deadline was a few days away.\n\nUtilize the Resources Available - There is no other class that has as many resources available as CS180, because…it's tough! If your code has even one bug, you probably won't be passing the test cases with full credit. Not to worry, the resources – Office Hours, SI Sessions, USB Help Room, Lab Sessions – are a lifesaver. They can be intimidating at first, but if you prepare a question and come ready to explain to the TA/tutor the issue and what you have tried to fix it, they can guide you to a better understanding so you can solve it at last.\n\nDon't Get Caught Up on the Details - CS180 doesn't just teach you the Java programming language, it teaches you how to learn. In reality, no skilled programmer knows all the small details off hand, but rather how to properly research and read documentation to look up the correct syntax when needed. So don't sweat it! When learning how to code, it can be frustrating trying to keep track of the intricacies like when to use length vs length() or how to format a class constructor. You might find it more useful to view the class as a tool, teaching you to use tools like StackOverflow and built-in IDE resources to figure out the correct code, and slowly but surely the process will become natural.\n\nMost importantly, enjoy the ride! Best of luck!"
    },
    {
      "title": "One Thing I Learned From My Freshman Year",
      "subtitle": "Freshman year taught me to how to find balance between school and my social life",
      "author": "Jillian Urgello",
      "authorImage": "../board member photos/webp/Jillian-Urgello.webp",
      "date": "April 15, 2022",
      "category": "FreshmanYear",
      "content": "If there's one thing I learned from my freshman year at Purdue, it is that keeping a balance between academics and a social life is no easy task. When you're leaning so far heavily to one side, it can be hard to find ways to balance the scale out again.\n\nThis is how I felt at the end of my first semester at Purdue. I didn't make much effort to join or be actively involved in any clubs and while I definitely wanted to, I was spending so much time studying I thought it was impossible for me to fit more things into my schedule. I ended up getting stuck in this endless cycle of classes and then studying and then classes again.\n\nTo break the cycle, I tried to make small changes in my daily life. At the start of second semester, I pushed myself to make time to attend club callouts or meetings. Building these things into my schedule at the beginning of the semester before classes ramped up was really helpful for me breaking out of the cycle and moving towards a more balanced college life. Personally, the hardest part in finding that balance was motivating myself to take that first step. What motivated me was the realization that college was going by a lot faster than I expected and that there were so many opportunities that I could only experience in college.\n\nDuring second semester, I became more involved in Purdue's Piano Club, Filipino Association and USB. Joining these clubs gave me an outlet to studying which helped lessen the amount of burn out I felt. Moreover, it was a way for me to make new friends and find a community at Purdue. This semester, I worked alongside other PFA members to put on the association's annual cultural show. Rehearsing and preparing for the show was time consuming which really forced me to manage my time better. Having things to do other than just studying helped me learn how to study more efficiently and take full advantage of the time I had. Although it was a lot of work to juggle everything, I had a stronger sense of accomplishment and motivation.\n\nAs the end of the second semester approaches, I can't say that I have found that perfect balance yet. But, I have improved. I've learned that finding a good balance isn't something that can be accomplished in a semester or even two semesters. Balance is something that is attained through incremental and consistent change. Moving forward, I know there will be times where the scale might have to tip more to one side, but at least now I know how to even it out again."
    },
    {
      "title": "Navigating My Freshman Year",
      "subtitle": "Navigating my Freshman Year comes with its own set of challenges, but with the help of clubs and friends, I was able to find a home at Purdue",
      "author": "Sweta Saravanan",
      "authorImage": "../board member photos/webp/Sweta-Saravanan.webp",
      "date": "April 6, 2022",
      "category": "FreshmanYear",
      "content": "As an out-of-state student attending Purdue, my freshmen year was very daunting because I knew no one, and I remember spending my first few weeks feeling lost.\n\nHowever, looking back now, I am grateful to have met all the people I call friends today!\n\nFor anyone who finds themselves in the same shoes as me, my only advice to you is to put yourself out there and take advantage of the events on campus (especially especially especially during your first few weeks!)\n\nApart from trying to make friends in my classes, attending club fairs, callouts, and floor events played a major role in meeting new people. I remember my first friend being a girl that lived on my floor all because I had asked her to grab lunch one day!\n\nI also met two of my closest friends at a South Asian Club Fair, simply because we all decided to grab food at Windsor after and make a trip to Walmart together since none of us had used the buses on campus yet!\n\nYou might be seeing that a common theme for most of my friendships is food! So get out there and ask people to get food!!!\n\nClub fairs are also not only a great place to find clubs that interest you but also a great way to meet even more people! Joining Boilermake and USB allowed me to make more friends within my major and meet upperclassmen as well! Not only was I able to meet new people but I also received a ton of insightful advice from class recommendations to internship advice!\n\nApart from 'major-related' clubs, I also recommend you try to join clubs where you can meet new people from different majors. For example, I joined Alpha Kappa Psi (AKPSI), a professional business fraternity on campus, which lead to me making some amazing and genuine friends. AKPSI also inspired me to pursue a minor in business economics which I would have never done if it weren't for the advice and guidance from my brothers!\n\nThere are a lot of cool and amazing clubs on campus which I even wished I joined, such as: the Purdue Concert Committee (PCC), Purdue EDM Club (PEDMC), and so much more!!!\n\nThere are definitely more ways to get involved on campus whether that is through research, joining a sports team (intermural or club), or by simply attending fun campus events! There is definitely a place for you on campus and the only way to find it is by putting yourself out there and trying new things!"
    },
    {
      "title": "My Experience as a First-Generation and Low-Income Student at Purdue",
      "subtitle": "The financial aid process isn't the easiest to navigate, but here are some tips for students with a similar background as me.",
      "author": "Arianna Smith",
      "authorImage": "../board member photos/webp/Arianna-Smith.webp",
      "date": "April 6, 2022",
      "category": "FirstGen, belonging",
      "content": "Hi everyone! I'm Arianna, a senior in CS at Purdue. I'm also a first-generation and low-income student, and I wanted to write this post to discuss my experiences in college and CS from that perspective. For me, it was initially jarring and persistently alienating to hold those identities in college, so I'm hoping that this post will give students from similar backgrounds a bit of guidance and perspective in the same situation. I'm also hoping that this post will give other students insight into this kind of experience, since it's often not discussed openly. I'll be discussing these issues from my own perspective and based on my own experiences; keep in mind that other students may have very different experiences, even under very similar circumstances.\n\nI always knew that I wanted to go to college, although I knew it would be difficult; my parents supported me if I wanted to go, but they made it clear that I would have to find a way to pay for my tuition, housing and expenses myself. At Purdue, this can seem to be an impossible goal, especially without financial aid; tuition for in-state students is frozen at $9,992 a year; the cheapest dorm housing is around $5,000 a year; and the cheapest meal plan (in 2018) was $2,000 a year for 8 meals a week. In the CS department, there are additional fees as well, meaning that a student who is expected to finance their own education has to find a way to pay ~$17,000 a year to attend school here.\n\nFor those who aren't familiar with the financial aid process, it starts with an award calculated by the university after acceptance. If you don't receive enough financial aid in your award package, then your next stop is loans or independent financial aid applications. Loans are terrifying - we all know the statistics about interest rates and timelines, and they scared me, so I personally decided to take these only as a last resort. Independent financial aid is difficult to attain, especially if you don't come from a privileged background. It requires an unbelievable amount of time and effort; I spent the majority of my senior year of high school applying for financial aid. Because I was also working as much as possible, this meant that I had almost no time to complete schoolwork. You need letters of recommendation, which are difficult to attain if you haven't had a lot of extracurricular or volunteer opportunities, as many students don't have. I needed a lot of complicated financial information from my parents (despite the fact that they were not contributing financial support - the law is stupid), which I was only able to access because I had supportive parents with enough free time to help me. You need an extremely impressive resume, as many independent scholarships are 'need-blind', meaning that you're often competing with students from more privileged backgrounds who have had a lot of educational and extracurricular opportunities that you haven't had (this especially holds for big-ticket scholarships, because they are often seen as a prestigious resume boost). Finally, you have to be able to interview well, which requires the right clothes (expensive), a lot of time to prepare, and confidence. It also requires that you sell yourself to your interviewer, which is personally complicated for students from disadvantaged backgrounds - you have to craft a specific narrative which paints you as both disadvantaged/suffering and accomplished/successful, which requires talking and thinking about yourself in a way that does not feel great.\n\nBy the time I started college, I was able to secure scholarships to cover most of my expenses. I continued applying for scholarships at college, and I usually found myself owing at least a few thousand each semester. I had been working and saving money all throughout high school, and I continued working in college - with my savings, I was able to pay my first year's expenses. I got the cheapest meal plan, which was 8 meals a week; I ate one meal a day and 2 on Mondays. I lost a significant amount of weight during my first semester , which was directly due to limited access to food on campus. My sophomore year, I discovered the on-campus food pantry, and used that to supplement my meal plan, which worked well. Worries about money, food and my future in college were always in the back of my mind, and while they (thankfully) weren't unmanageable for me, they did cause stress and tension, and detracted from the time I had to study.\n\nThose issues were all real, but fairly impersonal - I could think about practical issues like my finances, access to food, and work hours without emotional involvement. The personal struggles I had as a first-generation student were definitely more personally impactful. Within my first few weeks at Purdue, I started to realize that there seemed to be a particular background which a lot of CS/DS students came from. Whether this was reality or just my perception is hard to say (the department doesn't release statistics about first-generation or low-income students, so it's impossible to say whether we have a lower incidence of those types of students than other majors). A lot of my peers came from backgrounds where college education was very normalized, whereas I hadn't had much exposure to college graduates or preparation for college/white collar careers in my community. I am extremely proud of my community - my most influential, hard-working mentors are from there, and I've always felt supported and welcomed at home. have constantly supported me and my siblings. Yet I increasingly found myself unwilling to discuss family or hometown with my peers. I developed two separate identities - one for home, where I felt more comfortable, and one for school, where I was a bit more guarded. This isn't to say that I didn't make friends - I did, and the friendships were real. But I could never feel sure of myself or my life at school, when there were so many things that I felt I couldn't share. By my sophomore year, I had begun to feel totally separate from my classmates, and I also no longer felt comfortable at home; I was constantly divided between two identities, and didn't feel like I really belonged anywhere. This lack of community was significant for me; I was angry almost all the time. I was mad at my classmates for being different from me, I was mad at my family for being different from my classmates, and I was mad at myself for feeling so conflicted.\n\nThese are difficult issues to work through, as most identity struggles are. Ironically, the thing which helped me the most was to try to connect to others; this required me to check the assumptions I made about others, and question the anger I was feeling toward so many people in the community at Purdue. I found that most people shared some sort of struggle or experience, no matter how different they are on the surface; and trying to be as empathetic as possible helped me see that. There are certainly resources on campus for students who are going through a variety of experiences (some are listed below) and I recommend reaching out to them as soon as possible if you are feeling consistently conflicted, as it's best to try to address those issues early on. As trite as I'm sure it sounds, everyone belongs in Purdue, and everyone belongs in CS/DS, and we all deserve to feel that belonging.\n\nResources\n\nHorizons Student Support Services: https://www.purdue.edu/horizons/ Provides various services (tutoring, food pantry, study space, mentorship, community, etc) to first-generation and low-income students at Purdue.\n\nACE Food Pantry: https://www.purdue.edu/vpsl/leadership/About/ACE_Campus_Pantry.html Located in the Baptist Student Foundation basement across the street from Honors. Available to any student with a PUID. Offers fresh and shelf-stable food, different offerings each week.\n\nPurdue Financial Aid Office: https://www.purdue.edu/dfa/ They were super useful for me personally - I emailed them a lot about my financial aid package and scholarships, and they always responded quickly and thoroughly.\n\nFinancial Counseling: https://www.purdue.edu/recwell/fitness-wellness/wellness/one-on-one-coaching/financial-counseling.php This kind of counseling isn't specifically for low-income or first-generation students, although it can be helpful for them; it's a useful tool for anyone who isn't quite sure how to structure their finances during or after college.\n\nPurdue Office of Diversity & Inclusion: https://www.purdue.edu/diversity-inclusion/ I personally got a lot of benefit from the office of diversity and inclusion within my own college, but this office would apply more broadly to all students at Purdue. If you want, I recommend looking into similar resources at the college level as well.\n\nCenter for Career Opportunities: https://www.cco.purdue.edu/?_ga=2.18252985.1084848711.1649645585-1950701448.1636566598 The CCO was helpful in reviewing my resume and helping me prep for interviews, which I didn't have much independent experience with.\n\nNISO Office: https://www.purdue.edu/niso/ NISO helped connect me with scholarships and opportunities that I never would have otherwise known about. They are super friendly and inclusive, and they made me feel very welcome at Purdue.\n\n'Free Food at Purdue' GroupMe: Google the link! This is an informal group chat where students send info about free food being offered on campus. As a freshman, I took advantage of this as often as possible, and I got quite a few catered meals from it!\n\nOther College-level resources are prevalent and they're usually much more relevant/useful to a student's career goals. I am not familiar with every college, so I recommend doing some independent research to find some more resources at that level. Various cultural centers on campus were very inclusive and welcoming to me as well, and they are also great places to learn and find more resources."
    },
    {
      "title": "Getting Started in Computer Science Research as an Undergraduate",
      "subtitle": "Research in the CS department isn't the easiest to get involved in, but here we answer some common questions.",
      "author": "Simran Kadadi",
      "authorImage": "../board member photos/webp/Simran-Kadadi.webp",
      "date": "March 23, 2022",
      "category": "Research",
      "content": "Hi everyone,\n\nResearch has been an extremely influential part of my undergraduate journey at Purdue. It was extremely intimidating to get involved. At first, I struggled to find meaning in my coursework during the pandemic, and I was interested in making an impact in the field of computer science. I initially approached a professor with an interest in research my freshman year as I was interested in pursuing computational biology research that would complement my computer science background. Upon asking the professor to recommend courses that would prepare me for research, he recommended that I take his class on computational genomics to further determine my interest. I continued to seek knowledge from professors and faculty to best prepare me to successfully partake in research, but there is so much to uncover, and I am still learning more every day.\n\nToday, I had the opportunity to ask Ms. Ranjani Rao some questions about undergraduate research about what I wish I had known before I started.\n\nInterview with Ranjani L. Rao, Purdue Undergraduate Research and Career Development Specialist\n\nSimran: Why should computer science students consider undergraduate research?\n\nMs. Rao: First, students gain intellectual satisfaction from solving hard problems, putting their work in the classroom, seeand seeing how all concepts work in the real world. Intellectual satisfaction is tremendous because you learn a lot more. Research experience is highly valued in industry and career strategy. It also helps improve the responsibility of a person. If you participate in conferences or present your work, have the ability to improve your communication skills.\n\nSimran: What is the best way to approach professors for research?\n\nMs. Rao: When talking to CS professors, first analyze your own background and find out what aspects of cs you are interested in. Look at if you enjoyed CS 182, data structures, math classes, there are some areas of research like machine learning or computational sciences, or engineering. If you enjoyed CS 240, C programming, CS252, systems programming, then probably research in operating systems or systems security is better for you. First, analyze your background, then go around and study faculty bios and research professors on their websites. Read papers with a professor you want to work with. Play around with software that might be useful. Do your background work and then cold email professors or talk to people in their labs or others in research. Attend meet and greets and talks held by professors in the cs dept. The theory group has cs theory meetings every week. PurPL has a series of workshops where graduate students present their work. These are great avenues to learn about the research that different professors are conducting.\n\nSimran: Do you have to have taken a course with the professor you want to do research with?\n\nMs. Rao: It would be helpful to have taken a course with a professor. For example, if you want to do research with a professor who is specializing in networks. The ideal case is if the professor taught CS 473. It is okay if you took CS 473 with one professor, but decided to approach another in the same area. As long as you have a class in that area, you are going to be productive at that lab.\n\nSimran: What time in your college career do you recommend that students reach out to professors?\n\nMs. Rao: If this is a computer science professor, usually when you get past data structures and systems programming this is when you have courses and when you are ready to take upper-level courses. This is possible because you have some background classes. Then, prioritize the classes relevant to the professor you choose.\n\nSimran: How do you make sure you pick the right professor since there are many different professors working in the same area?\n\nMs. Rao: There is no perfect answer. You have to do trial and error. One thing you can do to understand what area is to read papers by the professors, especially if they have done work previously with undergraduate students. Try to see what the undergraduate did. This will help you understand what the professor did. Systems building and deployment. With your background in cs, you can figure out a little bit more.\n\nSimran: Do students get financially compensated for undergraduate students or can students do research for course credit?\n\nMs. Rao: There are different compensation In the early stages, when the professor doesn't really know the student, As professor David Blyth told me, there are two phases with working with any cs professors, figuring out if you can work with each other, nothing is paid. If they figure out if you work, there are many ways to get compensated for the research that you perform. For computer science, you can get credit for doing research with a professor. You and the professor decide how many hours of work howwork, how much research, you can decide to have workhave to work down for a grade or pass/fail. Research for pay happens when you have a greater level of trust with the faculty. Some faculty have funding from companies or NSF research grants where they can help support you. This happens when the student works in the summer or has been working for the lab for a few semesters.\n\nSimran: Do students have to be in CS honors to be active participants in research? Ms. Rao: CS honors is just a small part of the overall research done. When looking at the number of independent studies, 300 to 400 by students in cs. A number of students in cs honors were in the double-digits. No, you don't have to just be in cs honors, but you do have to be a conscientious student\n\nSimran: What are REUs (Research Experiences for Undergraduates)?\n\nMs. Rao: REUS are programs funded by NSF to support undergraduate research. Professors write up grand proposals and write undergrad extensions and the government gives them extra money to support undergraduate students. There are over approximately 115 opportunities just for computational sciences and engineering. This is the subarea that cs majors usually apply to over the country. It is a research boot camp. You work on a presentation and you present and the researcher mentors you and you get compensated which is nice. This opportunity is only open to US students and is extremely helpful for applying to graduate schools. https://www.nsf.gov/crssprgm/reu/\n\nSimran: Could you please explain what is the SURF program and who should apply to the SURF program?\n\nMs. Rao: SURF is a program at Purdue that is part of an opportunity to do research with an engineering professor. There is a symposium in summer where you get to work with a professor on a project and get to present at the end of the summer.\n\nThank you for reading!\n\nIf you have any questions for Ms. Rao, you can make an appointment with her. Her email is rrao@purdue.edu. Resume reviews are offered in Lawson commons on Mondays and Thursdays between 1:30-3:00 pm with Ranjani Rao."
    },
    {
      "title": "Do I Belong?",
      "subtitle": "Self doubt: it plagues us all",
      "author": "Vindhya Banda",
      "authorImage": "../board member photos/webp/Vindhya-Banda.webp",
      "date": "March 8, 2022",
      "category": "belonging",
      "content": "For as long as I can remember, I was sure I would pursue a career in a technical field. Growing up in a family full of software engineers, I was familiarized with technical terminology and computers very early on. While I never really pursued computer science seriously until high school, it was definitely a subject I was fond of throughout my schooling.\n\nI was so sure that this was what I wanted to do – that is, up until I stepped into the classroom of my first official CS class in high school. At first I thought it was just because attendance was low on the first day of classes, but by the time week 2 of 11th grade rolled around I realized that I was only one of 2 other girls pursuing CS at my high school.\n\nThe lack of representation made me question whether I was really cut out for the classes I was taking. Even though I would consistently be among the highest scoring students in class, there was a thought at the back of my mind that made me wonder when I would run out of \"luck\". Most A+'s felt like flukes and every failed code block would reinforce my fear of not being good enough. I guess that's quite dramatic but unfortunately it's not something I'm concocting for a blog post. Thankfully, this attitude really began to shift when I attended Purdue.\n\nWalking into CS180, the sheer number of women in the room greatly encouraged me. It made me feel capable and the gender gap in STEM suddenly seemed far less formidable. Even when taking difficult CS courses, I felt like my struggle was not just specific to my individual experience. The representation in CS, even if it is lesser than I would hope it to be, allowed me to approach difficult concepts without feeling the need to prove my worth and letting every minor mishap be a discouragement. For the most part, I don't think the discomfort of being a minority in tech really resurfaced until I had my first internship offer letter in hand.\n\nConfused? So was I. Getting an internship was supposed to be a happy thing, right? After a busy application season and many trying interviews, I was happy to see that all my efforts paid off. I felt so encouraged and motivated…until I was called a diversity hire. I was shocked. I thought I was past the stage of feeling insecure, I'd assumed the imposter syndrome had gone away. But at that one comment, old fears rushed back and I suddenly felt undeserving of that offer letter.\n\nFollowing that experience, it took me a while to straighten my shoulders and face the world confidently again. I'll spare you the details, but it involved a lot of pep-talking, Doja Cat, and solving LeetCode to convince myself that I belong. As a woman in today's STEM corporate landscape, you may find yourself in situations where you'll have to remind yourself, like I had to, that you are where you are because of your hard work, and not just luck.\n\nI'm grateful that over the years I've had the chance to be a part of incredible organizations, like Girls Who Code and The Girl Code, who are working very hard to bridge the gender gap in computer science. While I worked as an instructor/coordinator at these organizations, I noticed that women in tech tend to question themselves and their ability far more than their male counterparts. Hopefully, this mentality will change as trends in representation shift. However, I believe that it is essential for us to encourage ourselves and lift each other up along the way.\n\nI know that this fear of not-being enough or being out of place will surely crop up again, but it is up to us on how we want to react. The world is filled with inspiring individuals who belong to underrepresented communities in the fields they shine in. I look to them for inspiration and strive to emulate their resolve while I work towards carving out my own career path. This has greatly helped me and I encourage you to do the same. To all the students who may feel out of place at Purdue CS, to you I say: you belong.\n\nBoiler Up!"
    }
  ]
}